---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FilterNumericEquals Properties
FilterNumericEquals Class See Also Send Feedback
---

The FilterNumericEquals type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterNumericRuleEvaluator.) |

# See Also

FilterNumericEquals Class

Autodesk.Revit.DB Namespace